"use strict";

// Задание №1 ===========================================================>

/*

        let tempC = +prompt('Какая у Вас температура?');
        let tempF = (9 / 5) * tempC + 32;
        alert('Температура по Фаренгейту: ' + tempF + '!');


        // Задание №2 ===========================================================>


        let x = 10;
        let y = 20;
        x = [y, y = x][0]; // Этот способ я нашел в интернете, но не понимаю его до конца, хотелось бы, чтобы Вы его объяснили. Заранее спасибо!
        console.log(x, y);


        // Задание №3 ===========================================================>


        let name = "Василий";
        let admin = name;
        alert('В данный монент, Вы: ' + admin + '!');


        // Задание №4 ===========================================================>


        console.log(1000 + "108");  // В данном задании происходит конкатенация строк, явление впринципе мне понятно


        // Задание №5 ===========================================================>


        // Ответ в сообщении к ДЗ.

        */